app/Views/ujian/mulai.php


<?php $no=1;
    $db = \Config\Database::connect();
    $soal = $db->table('tbl_soal')
                ->join('tbl_jadwal_ujian', 'tbl_jadwal_ujian.id_jadwal=tbl_soal.id_jadwal_ujian', 'LEFT')
                ->where('tbl_soal.id_jadwal_ujian', $ujian['id_jadwal_ujian'])
                ->get()->getResultArray();
---
SELECT *
FROM `tbl_soal`
LEFT JOIN `tbl_jadwal_ujian` ON `tbl_jadwal_ujian`.`id_jadwal_ujian`=`tbl_soal`.`id_jadwal_ujian`
WHERE `tbl_soal`.`id_jadwal_ujian` = '6'