app/Views/hasil/index.php

SELECT *
FROM `tbl_jadwal_ujian`
LEFT JOIN `tbl_jadwal_pelajaran` ON `tbl_jadwal_pelajaran`.`id_jadwal`=`tbl_jadwal_ujian`.`id_jadwal`
LEFT JOIN `tbl_mapel` ON `tbl_mapel`.`id_mapel`=`tbl_jadwal_pelajaran`.`id_mapel`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru`=`tbl_jadwal_pelajaran`.`id_guru`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas`=`tbl_jadwal_pelajaran`.`id_kelas`
LEFT JOIN `tbl_jurusan` ON `tbl_jurusan`.`id_jurusan`=`tbl_jadwal_pelajaran`.`id_jurusan`
LEFT JOIN `tbl_ta` ON `tbl_ta`.`id_ta`=`tbl_jadwal_pelajaran`.`id_ta`
WHERE `tbl_jadwal_pelajaran`.`id_ta` = '2'
AND `tbl_jadwal_pelajaran`.`id_kelas` = '31'
SELECT COUNT(*) AS `numrows`
FROM `tbl_jawaban`
LEFT JOIN `tbl_soal` ON `tbl_soal`.`id_soal`=`tbl_jawaban`.`id_soal`
LEFT JOIN `tbl_jadwal_ujian` ON `tbl_jadwal_ujian`.`id_jadwal_ujian`=`tbl_soal`.`id_jadwal_ujian`
WHERE `tbl_soal`.`id_jadwal_ujian` = '6'
AND `tbl_jawaban`.`id_siswa` = '398'
SELECT *
FROM `tbl_soal`
LEFT JOIN `tbl_jawaban` ON `tbl_jawaban`.`id_soal`=`tbl_soal`.`id_soal`
WHERE `tbl_jawaban`.`id_siswa` = '384'
AND `tbl_soal`.`id_jadwal_ujian` = '6'
---
                    <tbody>
                      <?php $no=1;
                        $db = \Config\Database::connect();
                        $jadwal = $db->table('tbl_jadwal_ujian')
                            ->join('tbl_jadwal_pelajaran', 'tbl_jadwal_pelajaran.id_jadwal=tbl_jadwal_ujian.id_jadwal', 'LEFT')
                            ->join('tbl_mapel', 'tbl_mapel.id_mapel=tbl_jadwal_pelajaran.id_mapel', 'LEFT')
                            ->join('tbl_guru', 'tbl_guru.id_guru=tbl_jadwal_pelajaran.id_guru', 'LEFT')
                            ->join('tbl_kelas', 'tbl_kelas.id_kelas=tbl_jadwal_pelajaran.id_kelas', 'LEFT')
                            ->join('tbl_jurusan', 'tbl_jurusan.id_jurusan=tbl_jadwal_pelajaran.id_jurusan', 'LEFT')
                            ->join('tbl_ta', 'tbl_ta.id_ta=tbl_jadwal_pelajaran.id_ta', 'LEFT')
                            ->where('tbl_jadwal_pelajaran.id_ta', $ta_aktif['id_ta'])
                            ->where('tbl_jadwal_pelajaran.id_kelas', session()->get('id_kelas'))
                            ->get()->getResultArray();

                        foreach($jadwal as $key => $d){

                            $jmlhSoal = $db->table('tbl_jawaban')
                                ->join('tbl_soal', 'tbl_soal.id_soal=tbl_jawaban.id_soal', 'LEFT')
                                ->join('tbl_jadwal_ujian', 'tbl_jadwal_ujian.id_jadwal_ujian=tbl_soal.id_jadwal_ujian', 'LEFT')
                                ->where('tbl_soal.id_jadwal_ujian', $d['id_jadwal_ujian'])
                                ->where('tbl_jawaban.id_siswa', session()->get('id_siswa'))
                                ->countAllResults();
                            $jawaban  = $db->table('tbl_soal')
                                ->join('tbl_jawaban', 'tbl_jawaban.id_soal=tbl_soal.id_soal', 'LEFT')
                                ->where('tbl_jawaban.id_siswa', session()->get('id_siswa'))
                                ->where('tbl_soal.id_jadwal_ujian', $d['id_jadwal_ujian'])
                                ->get()->getResultArray();