app/Controllers/hasil.php

SELECT *
FROM `tbl_soal`
SELECT *
FROM `tbl_jawaban`
WHERE `id_siswa` = '398'
---
    public function index(): string
    {
        $idPengguna = session()->get('id_siswa');

        $soalModel = new ModelSoal();
        $jawabanPesertaModel = new ModelJawaban();
        $jadwalUjianModel = new ModelJadwalUjian();

         // Ambil semua soal dan kunci jawabannya
        $dataSoal = $soalModel->findAll();
        $kunciJawaban = [];
        foreach ($dataSoal as $soal) {
            $kunciJawaban[$soal['id_soal']] = $soal['jawaban'];
        }

        // Ambil jawaban peserta untuk pengguna ini
        $jawabanPeserta = $jawabanPesertaModel->where('id_siswa', $idPengguna)->findAll();