app/Controllers/ujian.php

INSERT INTO `tbl_jawaban` (`id_siswa`, `id_soal`, `jawaban`)
VALUES ('398','1','b'), ('398','2','c'), ('398','4','Tidak dijawab')
---
            if (!empty($dataToSave)) {
                try {
                    // Simpan batch data ke database
                    $saved = $jawabanModel->insertBatch($dataToSave);