app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_jurusan`
---
    public function JmlhJurusan(){
        return $this->db->table('tbl_jurusan')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_guru`
---
    public function JmlhGuru(){
        return $this->db->table('tbl_guru')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_siswa`
---
    public function JmlhSiswa(){
        return $this->db->table('tbl_siswa')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_kelas`
---
    public function JmlhKelas(){
        return $this->db->table('tbl_kelas')->countAll();