app/Models/ModelToken.php

    public function CekToken($id_jadwal_ujian, $token)
    {
        return $this->db->table('tbl_jadwal_ujian')
            ->where('id_jadwal_ujian', $id_jadwal_ujian)
            ->where('token', $token)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_jadwal_ujian`
WHERE `id_jadwal_ujian` = '6'
AND `token` = 'ugyfy'