app/Models/ModelAuth.php

    public function LoginUser($username, $password)
    {
        return $this->db->table('tbl_user')
            ->where('username', $username)
            ->where('password', $password)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'Amon Fautngiljanan'
AND `password` = 'admin123'

    public function LoginGuru($username, $password)
    {
        return $this->db->table('tbl_guru')
            ->where('nama_guru', $username)
            ->where('password', $password)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_guru`
WHERE `nama_guru` = 'LUDIA HEATUBUN, S.S'
AND `password` = 'LAHN'

    public function LoginSiswa($username, $password)
    {
        return $this->db->table('tbl_siswa')
            ->where('nama_siswa', $username)
            ->where('password', $password)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_siswa`
WHERE `nama_siswa` = 'ANTONELA SANGUR'
AND `password` = 'AASR'