app/Models/ModelJadwalUjian.php

SELECT *
FROM `tbl_jadwal_ujian`
LEFT JOIN `tbl_jadwal_pelajaran` ON `tbl_jadwal_pelajaran`.`id_jadwal`=`tbl_jadwal_ujian`.`id_jadwal`
LEFT JOIN `tbl_mapel` ON `tbl_mapel`.`id_mapel`=`tbl_jadwal_pelajaran`.`id_mapel`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru`=`tbl_jadwal_pelajaran`.`id_guru`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas`=`tbl_jadwal_pelajaran`.`id_kelas`
LEFT JOIN `tbl_jurusan` ON `tbl_jurusan`.`id_jurusan`=`tbl_jadwal_pelajaran`.`id_jurusan`
LEFT JOIN `tbl_ta` ON `tbl_ta`.`id_ta`=`tbl_jadwal_pelajaran`.`id_ta`
WHERE `id_jadwal_ujian` = '6'
---
    public function DetailData($id_jadwal_ujian)
    {
        return $this->db->table('tbl_jadwal_ujian')
            ->join('tbl_jadwal_pelajaran', 'tbl_jadwal_pelajaran.id_jadwal=tbl_jadwal_ujian.id_jadwal', 'LEFT')
            ->join('tbl_mapel', 'tbl_mapel.id_mapel=tbl_jadwal_pelajaran.id_mapel', 'LEFT')
            ->join('tbl_guru', 'tbl_guru.id_guru=tbl_jadwal_pelajaran.id_guru', 'LEFT')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas=tbl_jadwal_pelajaran.id_kelas', 'LEFT')
            ->join('tbl_jurusan', 'tbl_jurusan.id_jurusan=tbl_jadwal_pelajaran.id_jurusan', 'LEFT')
            ->join('tbl_ta', 'tbl_ta.id_ta=tbl_jadwal_pelajaran.id_ta', 'LEFT')
            ->where('id_jadwal_ujian', $id_jadwal_ujian)
            ->get()->getRowArray();