app/Views/template_guru.php

SELECT *
FROM `tbl_sekolah`
WHERE `id` = 1
---
  <head>
    <?php
        $db = \Config\Database::connect();
        $web = $db->table('tbl_sekolah')->where('id', 1)->get()->getRowArray();