app/Views/template_siswa.php

  <head>
    <?php
        $db = \Config\Database::connect();
        $web = $db->table('tbl_sekolah')->where('id', 1)->get()->getRowArray();
---
SELECT *
FROM `tbl_sekolah`
WHERE `id` = 1